let data = [
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 1, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '01', // Текущий месяц - 01 02 03 ... 09 10 11 12
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 1, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '02', // Текущий месяц - 01 02 03 ... 09 10 11 12
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 1, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '03', // Текущий месяц - 01 02 03 ... 09 10 11 12
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 1, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '04', // Текущий месяц - 01 02 03 ... 09 10 11 12
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 31, // Дней в месяце 28 29 30 31
        'firstDay': 3, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '05', // Текущий месяц - 01 02 03 ... 09 10 11 12
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 6, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '06', // Текущий месяц - 01 02 03 ... 09 10 11 12
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 31, // Дней в месяце 28 29 30 31
        'firstDay': 1, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '07', // Текущий месяц - 01 02 03 ... 09 10 11 12
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 31, // Дней в месяце 28 29 30 31
        'firstDay': 4, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '08', // Текущий месяц - 01 02 03 ... 09 10 11 12
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 7, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '09', // Текущий месяц - 01 02 03 ... 09 10 11 12
        'weeks': 6, // Недель в месяце 4 5 6

    },
    {

        'days': 31, // Дней в месяце 28 29 30 31
        'firstDay': 2, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '10', // Текущий месяц - 01 02 03 ... 09 10 11 12
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 5, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '11', // Текущий месяц - 01 02 03 ... 09 10 11 12
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 31, // Дней в месяце 28 29 30 31
        'firstDay': 7, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '12', // Текущий месяц - 01 02 03 ... 09 10 11 12
        'weeks': 6, // Недель в месяце 4 5 6

    },

];